Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
weather-input (InputLayer)      [(None, 60)]         0                                            
__________________________________________________________________________________________________
repeat_vector (RepeatVector)    (None, 8192, 60)     0           weather-input[0][0]              
__________________________________________________________________________________________________
image-input (InputLayer)        [(None, 64, 128, 3)] 0                                            
__________________________________________________________________________________________________
reshape (Reshape)               (None, 64, 128, 60)  0           repeat_vector[0][0]              
__________________________________________________________________________________________________
inputs-concat (Concatenate)     (None, 64, 128, 63)  0           image-input[0][0]                
                                                                 reshape[0][0]                    
__________________________________________________________________________________________________
pre-cbr-1 (Sequential)          (None, 64, 128, 64)  36544       inputs-concat[0][0]              
__________________________________________________________________________________________________
down_1-down (Sequential)        (None, 32, 64, 128)  131584      pre-cbr-1[0][0]                  
__________________________________________________________________________________________________
down_2-down (Sequential)        (None, 16, 32, 256)  525312      down_1-down[0][0]                
__________________________________________________________________________________________________
down_3-down (Sequential)        (None, 8, 16, 512)   2099200     down_2-down[0][0]                
__________________________________________________________________________________________________
noise-input (InputLayer)        [(None, 100)]        0                                            
__________________________________________________________________________________________________
down_4-down (Sequential)        (None, 4, 8, 1024)   8392704     down_3-down[0][0]                
__________________________________________________________________________________________________
dense (Dense)                   (None, 1024)         103424      noise-input[0][0]                
__________________________________________________________________________________________________
down_5-down (Sequential)        (None, 2, 4, 1024)   16781312    down_4-down[0][0]                
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 2, 4, 128)    0           dense[0][0]                      
__________________________________________________________________________________________________
add-noise (Concatenate)         (None, 2, 4, 1152)   0           down_5-down[0][0]                
                                                                 reshape_1[0][0]                  
__________________________________________________________________________________________________
up_5-up (Sequential)            (None, 4, 8, 512)    9439232     add-noise[0][0]                  
__________________________________________________________________________________________________
up_5-concatenate (Concatenate)  (None, 4, 8, 1536)   0           up_5-up[0][0]                    
                                                                 down_4-down[0][0]                
__________________________________________________________________________________________________
up_4-up (Sequential)            (None, 8, 16, 768)   18877440    up_5-concatenate[0][0]           
__________________________________________________________________________________________________
up_4-concatenate (Concatenate)  (None, 8, 16, 1280)  0           up_4-up[0][0]                    
                                                                 down_3-down[0][0]                
__________________________________________________________________________________________________
up_3-up (Sequential)            (None, 16, 32, 640)  13109760    up_4-concatenate[0][0]           
__________________________________________________________________________________________________
up_3-concatenate (Concatenate)  (None, 16, 32, 896)  0           up_3-up[0][0]                    
                                                                 down_2-down[0][0]                
__________________________________________________________________________________________________
up_2-up (Sequential)            (None, 32, 64, 448)  6424320     up_3-concatenate[0][0]           
__________________________________________________________________________________________________
up_2-concatenate (Concatenate)  (None, 32, 64, 576)  0           up_2-up[0][0]                    
                                                                 down_1-down[0][0]                
__________________________________________________________________________________________________
up_1-up (Sequential)            (None, 64, 128, 288) 2655360     up_2-concatenate[0][0]           
__________________________________________________________________________________________________
up_1-concatenate (Concatenate)  (None, 64, 128, 352) 0           up_1-up[0][0]                    
                                                                 pre-cbr-1[0][0]                  
__________________________________________________________________________________________________
post-cbr-1 (Sequential)         (None, 64, 128, 352) 1116544     up_1-concatenate[0][0]           
__________________________________________________________________________________________________
rgb-conv (Conv2D)               (None, 64, 128, 3)   1059        post-cbr-1[0][0]                 
==================================================================================================
Total params: 79,693,795
Trainable params: 79,681,763
Non-trainable params: 12,032
__________________________________________________________________________________________________
